OdDAI.EnumerationType.setExtensible(System.Boolean)
details
Sets extensible flag.

OdDAI.EnumerationType.setElements(OdArray&lt;OdAnsiString,OdObjectsAllocator&lt;OdAnsiString&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
details
Sets the array of enumeration values in text representation.
\param elements [in] An array of ANSI-strings.

OdDAI.EnumerationType.m_specifiedType
Corresponding specified enumeration value data type.

OdDAI.EnumerationType.m_basedOn
A pointer to base enumeration type.

OdDAI.EnumerationType.m_bExtensible
A boolean value that determines whether enumeration type is extensible.

OdDAI.EnumerationType.m_elements
An ANSI string array that contains the text representation of the enumeration values.

OdDAI.EnumerationType.stringToValueCaseInsensitive(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Converts a string representation of the enumeration value into an integer representation that corresponds to the specified enumeration value.
The method searches the specified string value in the elements list and returns the position of the found element.
\param convertWhat [in] An ANSI string that contains the value to be converted.
\returns
A signed integer value that corresponds to the specified string representation of the enumeration value.
If the specified representation doesn't match any integer representation of the enumeration value, the method returns -1.
\remarks
The method uses the CASE-INSENSITIVE search when it is looking for the integer representation of the enumeration value that corresponds to the specified string representation.

OdDAI.EnumerationType.stringToValue(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Converts a string representation of the enumeration value into an integer representation that corresponds to the specified enumeration value.
The method searches the specified string value in the elements list and returns the position of the found element.
\param convertWhat [in] An ANSI string that contains the value to be converted.
\returns
A signed integer value that corresponds to the specified string representation of the enumeration value.
If the specified representation doesn't match any integer representation of the enumeration value, the method returns -1.
\remarks
The method uses the CASE-SENSITIVE search when it is looking for the integer representation of the enumeration value that corresponds to the specified string representation.

OdDAI.EnumerationType.valueToString(System.Int32)
\details
Converts the enumeration value into a null-terminated string.
\param convertWhat [in] An signed integer value that contains the value to be converted.
\returns
A null-terminated string that contains the text representation of the specified enumeration value.
If the method can not convert specified enumeration value into a string representation (for example when the specified enumeration value is not valid), the method returns an empty string.

OdDAI.EnumerationType.isValid(System.Int32)
\details
Checks whether a specified enumeration value is valid.
\param testValue [in] An unsigned integer value that contains the value to check.
\returns true if the specified value is valid; otherwise, the method returns false.

OdDAI.EnumerationType.getUnsetIndex
\details
Retrieves the unset value (value that is not set) for the enumeration data type.
\returns An signed integer value that corresponds to the unset value (value that is not set) of the enumeration data type.

OdDAI.EnumerationType.elements
\details
Retrieves the list of values of the enumeration data type.
\returns A list of ANSI strings that contains values of the enumeration data type.

OdDAI.EnumerationType.Dispose
\details
Destroys the enumeration data type object and frees the memory it has been residing.

OdDAI.EnumerationType.#ctor
\details
Creates a new enumeration data type object with default parameters.

OdDAI.EnumerationType
\details
A class that represents the enumeration data type that stores metadata for the ENUMERATION TYPE defined within an EXPRESS schema.